
%------Данные для экраноплана с хвостовым оперением------

%function Object_2
  
global Ba Iz
%.....................................................................................................................
global k_alfa   Alfa_zad   k_h   h_zad 
global k_xt   xt_zad   %xt_zad_1    xt_zad_2   xt_zad_3    xt_zad_4    xt_zad_5    xt_zad_6
global Cya_pol
global Cxa_pol
global mz_Alfa
global mz_po_delta_1
global mz_po_delta_2


% Характеристическая площадь
% S_kr=2.479733;
% Характерный линейный размер
Ba=1.4196;
% Инерционный момент относительно оси z
Iz=0.4;
%k_h – количество отстояний.
k_h=7;
%h_zad – заданные отстояния.
h_zad= [0.10 0.15 0.20 0.40 0.60 1.00 3.]; 
%k_alfa – количество углов атаки.
k_alfa=4;
%Alfa_zad – заданные углы атаки.
Alfa_zad=[-2. 0. 2. 4.5];
% k_xt - количество положений центра тяжести.
k_xt=8;
% xt_zad - координаты центра тяжести в относительных величинах.
xt_zad=[0. 0.2326 0.4653 0.698 0.9313 1.164 1.3966 1.6293];

% xt_zad_1=0.;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol=[0.55431394  0.67438192  0.77265832  0.88446777;
         0.47440199  0.5955042   0.69550155  0.81848279;
         0.42134583  0.53562857  0.64789358  0.77096457;
         0.32274923  0.42854125  0.5329917   0.65455275;
         0.29178091  0.39543932  0.48683642  0.60691435;
         0.26398692  0.36213533  0.45630823  0.56772896;
         0.25536747  0.35446319  0.44875529  0.55612798];
     
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol=[0.042163159  0.060088192  0.082569042  0.11957579;
         0.04026646   0.056487765  0.077665158  0.11281647;
         0.038613749  0.053713923  0.07439596   0.10772407;
         0.035663625  0.048395892  0.06633511   0.095642825;
         0.034330121  0.046519992  0.062865044  0.090513467;
         0.033766149  0.04504488   0.060586358  0.08676295;
         0.033527575  0.044820718  0.060177879  0.085711928];
     
%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний. 
mz_Alfa=[0.57380685    0.67948784    0.76621719     0.87587322;
                 0.51078598    0.61669055    0.71036056     0.82432874;
                 0.47063984    0.57582428    0.67215132     0.78556223;
                 0.39420991    0.49560468    0.5915953        0.71231408;
                 0.36239676    0.4593092       0.55913413     0.67656876;
                 0.34585372    0.43843067     0.53265248     0.65192664;
                 0.33796585    0.4287105       0.52129947     0.64254764];

%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2=[0  0  0  0  0  0  0];

% xt_zad_2=0.2326;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,2)=[0.53619567    0.67438192    0.78443219    0.91863448;
                          0.46125225    0.5955042      0.7104669      0.84539813;
                          0.41566147    0.53562857    0.65143255    0.78519779;
                          0.3239275       0.42854125   0.53048685    0.66555423;
                          0.29110081     0.39543932   0.49040477    0.60968602;
                          0.26347921     0.36213533   0.45328768    0.56801103;
                          0.2552595       0.35446319   0.44447508    0.55728862];
     
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,2)=[0.042221868    0.060088192    0.083117152    0.12291199;
                          0.039773491    0.056487765    0.078499412    0.11554496;
                          0.038199156    0.053713923    0.074758078    0.10939428;
                          0.035393866    0.048395892    0.065890516    0.096429631;
                          0.03427182       0.046519992    0.062863744   0.090358278;
                          0.033923674     0.04504488      0.060132686   0.086318841;
                          0.033714749     0.044820718    0.059587391   0.085427209];
     
%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, 
% для разных отстояний. 
mz_Alfa(:,:,2)=[0.42978943    0.51369516    0.58338813    0.66849678;
                          0.391582        0.47028948    0.5423246      0.62988769;
                          0.36115785    0.44414326    0.51827705    0.60698942;
                          0.31159913    0.39025043    0.46530257    0.54860114;
                          0.2917479      0.36209286    0.43702478    0.52582249;
                          0.2809544      0.34940191    0.42116689    0.51117152;
                          0.2756406      0.34156789    0.41298639    0.50336739];

%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,2)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,2)=[0  0  0  0  0  0  0];

% xt_zad_3=0.4653;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,3)=[0.5233349  0.67438192  0.7985166   0.95751639;
                0.45118503  0.5955042   0.71865663  0.86938618;
                0.40299497  0.53562857  0.66222726  0.80690498;
                0.32248864  0.42854125  0.53782713  0.66891444;
                0.28881227  0.39543932  0.48916589  0.61500383;
                0.26448551  0.36213533  0.45339541  0.57266922;
                0.25623473  0.35446319  0.44265758  0.55766747];
     
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,3)=[0.041319051  0.060088192  0.083719214  0.12598178;
                0.03955365   0.056487765  0.078892576  0.11745653;
                0.038017623  0.053713923  0.075064996  0.11149016;
                0.035306284  0.048395892  0.066315917  0.097083533;
                0.034201189  0.046519992  0.062815332  0.090881645;
                0.033620253  0.04504488   0.060253682  0.086634102;
                0.033372777  0.044820718  0.059483367  0.085186197];

%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний.     
mz_Alfa(:,:,3)=[0.29414742  0.34790248  0.39569186  0.44349876;
                0.27493599  0.32388841  0.37221487  0.42626279;
                0.26363533  0.31246225  0.358775    0.41252688;
                0.23051307  0.28189618  0.32983438  0.3888927;
                0.22139199  0.26787651  0.31849648  0.37390095;
                0.2163558   0.26037315  0.31075318  0.36804066;
                0.21273293  0.25442527  0.30495156  0.36409554];

%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,3)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,3)=[0  0  0  0  0  0  0];   

% xt_zad_4=0.698;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,4)=[0.51215173  0.67438192  0.82421829  1.0037977;
                0.44910317  0.5955042   0.73033604  0.89720479;
                0.39977168  0.53562857  0.66764717  0.8250416;
                0.31454047  0.42854125  0.53777068  0.67495535;
                0.28988206  0.39543932  0.48974216  0.6125;
                0.26615943  0.36213533  0.45985971  0.57633198;
                0.257813    0.35446319  0.44790902  0.56142555];
     
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,4)=[0.040974494  0.060088192  0.085068164  0.13000278;
                0.039207926  0.056487765  0.07990542   0.12058094;
                0.037683994  0.053713923  0.075562032  0.11321652;
                0.035308978  0.048395892  0.066354899  0.097690644;
                0.034469024  0.046519992  0.062792063  0.091;
                0.033459455  0.04504488   0.0606768    0.08713465;
                0.03328492   0.044820718  0.059834399  0.085727376];

%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний.     
mz_Alfa(:,:,4)=[0.16216498  0.1811098   0.18923388  0.19429042;
                 0.15997917  0.17998733  0.19277872  0.21127543;
                0.15824123  0.17878123  0.19548098  0.21500646;
                0.15233103  0.17654193  0.1969343  0.21988607;
                0.14968367  0.17466017  0.19723013  0.2212;
                0.14848817  0.17334438  0.19734731  0.22155966;
                0.14784035  0.17228266  0.19746558  0.22256733];

%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,4)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,4)=[0  0  0  0  0  0  0];

% xt_zad_5=0.9313;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,5)=[0.49922941  0.67438192  0.84029585  1.0476378;
                0.43548148  0.5955042   0.74376352  0.93228493;
                0.39557306  0.53562857  0.67222984  0.85281995;
                0.31399143  0.42854125  0.53996562  0.68666522;
                0.2863223   0.39543932  0.49617849  0.61873248;
                0.26791434  0.36213533  0.45727553  0.57182924;
                0.26037046  0.35446319  0.44428702  0.5557658];       
     
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,5)=[0.040686038  0.060088192  0.085860858  0.13265705;
                0.038856188  0.056487765  0.080624574  0.12390873;
                0.037690403  0.053713923  0.075834761  0.11592624;
                0.035123364  0.048395892  0.066499001  0.098881464;
                0.034099943  0.046519992  0.063200596  0.091598967;
                0.033776279  0.04504488   0.060467084  0.086767297;
                0.033635991  0.044820718  0.059812953  0.085301804];

%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний.     
mz_Alfa(:,:,5)=[0.038226881  0.01584207   -0.017486588  -0.070486328;
                0.050369927  0.032666773  0.0096620899  -0.033619434;
                0.061507832  0.048722908  0.03381217    -0.001271284;
                0.078597007  0.071885805  0.064734185   0.05073251;
                0.080165076  0.076165264  0.073364874   0.069741006;
                0.080346721  0.081060527  0.082460496   0.085625596;
                0.080864095  0.082890356  0.085288374   0.088894399];
            
%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,5)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,5)=[0  0  0  0  0  0  0];   

% xt_zad_6=1.164;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,6)=[0.48286761  0.67438192  0.85481437  1.109665;
                 0.42789323  0.5955042   0.75176676  0.97103398;
                0.38571661  0.53562857  0.68753997  0.87099802;
                0.31580699  0.42854125  0.55152862  0.69877144;
                0.28366552  0.39543932  0.4936265   0.62418342;
                0.25998017  0.36213533  0.45374781  0.5743436;
                0.25382955  0.35446319  0.44652403  0.55586966];
                            
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,6)=[0.040475057  0.060088192  0.086752063  0.13511687;
                0.038797426  0.056487765  0.081216627  0.12738306;
                0.038020492      0.053713923  0.076909757  0.11819684;
                0.035090132  0.048395892  0.067206703  0.10060746;
                0.034111162  0.046519992  0.063079158  0.091988305;
                0.033487368  0.04504488   0.06055766   0.086955717;
                0.033280279  0.044820718  0.060042296  0.085246282];

%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний.     
mz_Alfa(:,:,6)=   [-0.068003367   -0.14995061    -0.22610867   -0.3761537;
                 -0.046859287   -0.1157343     -0.18110848   -0.28195689;
                -0.028677        -0.082958108   -0.13585757   -0.21306103;
                -0.0019809523  -0.041468446   -0.079491012  -0.13137618;
                0.015331582    -0.018051081   -0.046766526  -0.086034859;
                0.028143077    -0.0049682344  -0.027098559  -0.058242442;
                0.028234377    -0.0004522575  -0.022073352  -0.048414669];

%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,6)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,6)=[0  0  0  0  0  0  0];

% xt_zad_7=1.463;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,7)=[0.47504171	0.67438192	0.87788012	1.116;
                0.42316208	0.5955042	0.76554287	1.0142399;
               0.38221567	0.53562857	0.69504623	0.90066943;
                0.31131862	0.42854125	0.54820052	0.70186671;
                0.28509852	0.39543932	0.49907914	0.62766358;
                0.26270793	0.36213533	0.45695191	0.57604274;
                0.25891118	0.35446319	0.44508096	0.55633302];
     
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,7)=[0.040183257	0.060088192	0.088146414	0.142;
                0.038817255	0.056487765	0.082351237	0.13121688;
                0.037792073	0.053713923	0.077281798	0.1216598;
                0.035288724	0.048395892	0.067261534	0.10125628;
                0.034257888	0.046519992	0.063947667	0.09285717;
                0.033515603	0.04504488	0.061035962	0.087417463;
               0.033354065	0.044820718	0.060041433	0.085530017];

%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний.     
mz_Alfa(:,:,7)=[-0.18961966	-0.31574329	-0.46266512	-0.676;
                -0.15648039	-0.26213537	-0.3824244	-0.5666045;
                -0.12263066	-0.21463912	-0.31397526	-0.45562209;
                -0.07504487	-0.1368227	-0.20559893	-0.29955476;
                -0.060219333	-0.11426743	-0.1725589	-0.25605827;
                -0.045936625	-0.095996996	-0.14590772	-0.20802758;
                -0.044936625	-0.093394871	-0.13669343	-0.19213902];

%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,7)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,7)=[0  0  0  0  0  0  0];

% xt_zad_8=1.6293;
%Cya_pol – зависимость коэффициента подъемной силы от угла атаки, для разных отстояний.  
Cya_pol(:,:,8)=[0.4612035	0.67438192	0.90137851	1.214;
                0.4127425	0.5955042	0.78515849	1.0576837;
               0.37759403	0.53562857	0.70401334	0.93922471;
                0.30983971	0.42854125	0.54783255	0.71063969;
                0.29638022	0.39543932	0.49647679	0.62818095;
                0.26636197	0.36213533	0.45654412	0.57906179;
                0.26236197	0.35413533	0.44554412	0.55906179];
            
%Cxa_pol – зависимость коэффициента лобового сопротивления от угла атаки, для разных отстояний.
Cxa_pol(:,:,8)=[0.04011782	0.060088192	0.089037533	0.142;
                0.03853596	0.056487765	0.083500821	0.13349486;
                0.037440141	0.053713923	0.078183238	0.12521605;
                0.035327094	0.048395892	0.067513884	0.10206399;
                0.033694973	0.046519992	0.063869665	0.093089938;
                0.033526531	0.04504488	0.060709918	0.087966156;
                0.033426531	0.04454488	0.059709918	0.084966156];
           
%mz_Alfa - зависимость коэффициента продольного момента от угла атаки, для разных отстояний.     
mz_Alfa(:,:,8)=[-0.29038156	-0.48153597	-0.70400783	-0.996;
                -0.24656843	-0.40853645	-0.58499554	-0.8619795;
                -0.21403545	-0.34632014	-0.50160151	-0.72718611;
                -0.15059094	-0.24217695	-0.34004097	-0.4811741;
                -0.13751438	-0.21148377	-0.29527834	-0.39705894;
                -0.11617823	-0.18502576	-0.25740257	-0.35545809;
                -0.11517823	-0.18302576	-0.24840257	-0.34145809];
            
%mz_po_delta_1 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 1 
mz_po_delta_1(:,:,8)=[0  0  0  0  0  0  0];

%mz_po_delta_2 – зависимость коэффициента продольного момента (h=var) от угла отклонения управляющей поверхности 2 
mz_po_delta_2(:,:,8)=[0  0  0  0  0  0  0];            